# FabricationDimensionDefinition Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationDimensionDefinition Class
Members See Also
---
Fabricaition dimension definition
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public class FabricationDimensionDefinition : IDisposable
```

Visual Basic
---
```text
Public Class FabricationDimensionDefinition _
	Implements IDisposable
```

Visual C++
---
```text
public ref class FabricationDimensionDefinition : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..FabricationDimensionDefinition
# See Also
FabricationDimensionDefinition Members
Autodesk.Revit.DB Namespace